In [1]:
import pandas as pd

In [2]:
data = {
    "name": ["Amit", "Sara", "John", "Fatima", "Rahim"],
    "age": [23, 29, 31, 25, 28],
    "salary": [40000, 52000, 60000, 45000, 48000],
    "department": ["IT", "HR", "IT", "Finance", "HR"]
}

df = pd.DataFrame(data)
print(df)

     name  age  salary department
0    Amit   23   40000         IT
1    Sara   29   52000         HR
2    John   31   60000         IT
3  Fatima   25   45000    Finance
4   Rahim   28   48000         HR

In [3]:
df.head(3)

   name  age  salary department
0  Amit   23   40000         IT
1  Sara   29   52000         HR
2  John   31   60000         IT

In [4]:
df.columns

Index(['name', 'age', 'salary', 'department'], dtype='str')